In [1077]:
import pandas as pd
from sqlalchemy import create_engine, MetaData, Table, types

In [1078]:
# Connect to db
engine = create_engine('postgresql://akpwflpw:au-4LYNi7Wc7T_vgp72qBX2VYUqPiqyb@raja.db.elephantsql.com:5432/akpwflpw?sslmode=require')

In [1079]:
gdp_df = pd.read_csv('data/cleaned_gdp.csv')
employment_df = pd.read_csv('data/cleaned_employment_by_industry.csv')
graduates_df = pd.read_csv('data/cleaned_graduates.csv')

## Create Date Dimension

In [1080]:
unique_dates = gdp_df['Date'].drop_duplicates().reset_index(drop=True)

# Date PFK
date_range = range(1, len(unique_dates) + 1)

# Create the Date dimension DataFrame
df_date_dim = pd.DataFrame({'date_key': date_range, 'year': unique_dates})

In [1081]:
df_date_dim

    date_key  year
0          1  2000
1          2  2001
2          3  2002
3          4  2003
4          5  2004
5          6  2005
6          7  2006
7          8  2007
8          9  2008
9         10  2009
10        11  2010
11        12  2011
12        13  2012
13        14  2013
14        15  2014
15        16  2015
16        17  2016
17        18  2017
18        19  2018
19        20  2019
20        21  2020

In [1082]:
# Insert DataFrame into the database table
# df_date_dim.to_sql(
#     name='dim_date',  
#     con=engine,  
#     schema='public',  
#     if_exists='replace',  
#     index=False,  
#     dtype={
#         'date_key': sqlalchemy.types.Integer(),  
#         'date': sqlalchemy.types.Integer()      
#     }
# )

## Create education dimension

In [1083]:
unique_education_records = graduates_df['Field Of Study'].drop_duplicates().reset_index(drop=True)

# education PFK
education_range = range(1, len(unique_education_records) + 1)

# Create the Education dimension DataFrame
df_education_dim = pd.DataFrame({
    'education_key': education_range,
    'field_of_study': unique_education_records
})

In [1084]:
df_education_dim

    education_key                                     field_of_study
0               1  Agriculture, natural resources and conservatio...
1               2  Architecture, engineering and related technolo...
2               3  Business, management and public administration...
3               4                                      Education [1]
4               5                     Health and related fields [10]
5               6                                     Humanities [3]
6               7  Mathematics, computer and information sciences...
7               8                                        Other  [12]
8               9               Personal improvement and leisure [0]
9              10  Personal, protective and transportation servic...
10             11    Physical and life sciences and technologies [6]
11             12        Social and behavioural sciences and law [4]
12             13                                       Unclassified
13             14  Visual and performing arts, and communications...

In [1085]:
# df_education_dim.to_sql(
#     name='dim_education', 
#     con=engine, 
#     schema='public', 
#     if_exists='replace',  
#     index=False,  
#     dtype={
#         'education_key': sqlalchemy.types.Integer(),  
#         'field_of_study': sqlalchemy.types.TEXT()    
#     }
# )

## Create industry dimension

In [1086]:
unique_NAICS = gdp_df['NAICS'].drop_duplicates().reset_index(drop=True)

# Generate a range for NAICS PFK
NAICS_range = range(1, len(unique_NAICS) + 1)

# Create the Demographic dimension DataFrame
df_industry_dim = pd.DataFrame({
    'industry_key': NAICS_range,
    'sector_name': unique_NAICS,
})

In [1087]:
df_industry_dim

    industry_key                                        sector_name
0              1               Accommodation and food services [72]
1              2    Agriculture, forestry, fishing and hunting [11]
2              3                                  Construction [23]
3              4                          Educational services [61]
4              5                         Finance and insurance [52]
5              6             Health care and social assistance [62]
6              7       Information, culture and recreation [51, 71]
7              8  Business, building and other support services ...
8              9                              Manufacturing [31-33]
9             10  Mining, quarrying, and oil and gas extraction ...
10            11  Other services (except public administration) ...
11            12  Professional, scientific and technical service...
12            13                         Public administration [91]
13            14            Real estate and rental and leasing [53]
14            15                               Retail trade [44-45]
15            16             Transportation and warehousing [48-49]
16            17                                     Utilities [22]

In [1088]:
# df_industry_dim.to_sql(
#     name='dim_industry',  
#     con=engine,  
#     schema='public',  
#     if_exists='replace',  
#     index=False,  
#     dtype={
#         'industry_key': sqlalchemy.types.Integer(), 
#         'sector_name': sqlalchemy.types.TEXT()  
#     }
# )

## Create demographic dimension

In [1089]:
unique_demographic = employment_df[['Gender', 'Age Group']].drop_duplicates().reset_index(drop=True)

# Generate a range for demographic PFK
demographic_range = range(1, len(unique_demographic) + 1)

# Create the labour force charact dimension DataFrame
df_demographic_dim = pd.DataFrame({
    'demographic_key': demographic_range,
    'gender': unique_demographic['Gender'],
    'age_group': unique_demographic['Age Group']
})

In [1090]:
df_demographic_dim

   demographic_key  gender          age_group
0                1  Female     15 to 24 years
1                2  Female     25 to 54 years
2                3  Female  55 years and over
3                4    Male     15 to 24 years
4                5    Male     25 to 54 years
5                6    Male  55 years and over

In [1091]:
# df_demographic_dim.to_sql(
#     name='dim_demographic',
#     con=engine,
#     schema='public',
#     if_exists='replace',
#     index=False,
#     dtype={
#         'demographic_key': sqlalchemy.types.Integer(), 
#         'gender': sqlalchemy.types.String(length=255),
#         'age_group': sqlalchemy.types.String(length=255),
#         'employment_status': sqlalchemy.types.String(length=255)
        
#     }
# )

## Create employment status

In [1092]:
unique_status = employment_df['Labour Force Characteristics'].drop_duplicates().reset_index(drop=True)

# Generate a range for demographic PFK
status_range = range(1, len(unique_status) + 1)

# Create the labour force charact dimension DataFrame
df_status_dim = pd.DataFrame({
    'employment_key': status_range,
    'employment_status': unique_status
})

In [1093]:
df_status_dim

   employment_key employment_status
0               1          Employed
1               2        Unemployed

In [1094]:
# df_status_dim.to_sql(
#     name='dim_employment_status',
#     con=engine,
#     schema='public',
#     if_exists='replace',
#     index=False,
#     dtype={
#         'employment_key': sqlalchemy.types.Integer(), 
#         'employment_status': sqlalchemy.types.String(length=255)
        
#     }
# )

In [1095]:
employment_df

,Date,Labour Force Characteristics,NAICS,Gender,Age Group,Value
0,2000,Employed,Accommodation and food services [72],Female,15 to 24 years,235000
1,2000,Employed,Accommodation and food services [72],Female,25 to 54 years,285400
2,2000,Employed,Accommodation and food services [72],Female,55 years and over,37700
3,2000,Employed,Accommodation and food services [72],Male,15 to 24 years,160900
4,2000,Employed,Accommodation and food services [72],Male,25 to 54 years,193500
...,...,...,...,...,...,...
4279,2020,Unemployed,Utilities [22],Female,25 to 54 years,0
4280,2020,Unemployed,Utilities [22],Female,55 years and over,0
4281,2020,Unemployed,Utilities [22],Male,15 to 24 years,0
4282,2020,Unemployed,Utilities [22],Male,25 to 54 years,1743
4283,2020,Unemployed,Utilities [22],Male,55 years and over,0

In [1096]:
gdp_df

,Date,NAICS,Value,Value Binned
0,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]"
1,2000,"Agriculture, forestry, fishing and hunting [11]",23120000000,"(21000000000.0, 49000000000.0]"
2,2000,Construction [23],51054000000,"(49000000000.0, 76000000000.0]"
3,2000,Educational services [61],51839000000,"(49000000000.0, 76000000000.0]"
4,2000,Finance and insurance [52],62648000000,"(49000000000.0, 76000000000.0]"
...,...,...,...,...
352,2020,Public administration [91],158772000000,"(158000000000.0, 185000000000.0]"
353,2020,Real estate and rental and leasing [53],293886000000,"(267000000000.0, 294000000000.0]"
354,2020,Retail trade [44-45],106641000000,"(103000000000.0, 131000000000.0]"
355,2020,Transportation and warehousing [48-49],95339000000,"(76000000000.0, 103000000000.0]"
356,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]"

In [1097]:
graduates_df

,Date,Field Of Study,Gender,Value,Value Binned
0,2000,"Agriculture, natural resources and conservatio...",Man,7818.0,"(0.0, 16247.1]"
1,2000,"Agriculture, natural resources and conservatio...",Woman,6390.0,"(0.0, 16247.1]"
2,2000,"Architecture, engineering and related technolo...",Man,52596.0,"(48717.3, 64952.4]"
3,2000,"Architecture, engineering and related technolo...",Woman,12987.0,"(0.0, 16247.1]"
4,2000,"Business, management and public administration...",Man,49608.0,"(48717.3, 64952.4]"
...,...,...,...,...,...
583,2020,Social and behavioural sciences and law [4],Woman,118131.0,"(113657.7, 129892.8]"
584,2020,Unclassified,Man,5154.0,"(0.0, 16247.1]"
585,2020,Unclassified,Woman,3426.0,"(0.0, 16247.1]"
586,2020,"Visual and performing arts, and communications...",Man,16872.0,"(16247.1, 32482.2]"
587,2020,"Visual and performing arts, and communications...",Woman,26505.0,"(16247.1, 32482.2]"

## Rename some columns to prevent eliminating them when joining

In [1098]:
# Renaming columns for employment_df
employment_df = employment_df.rename(columns={
    'Value': 'Number_of_Employees',
    'Gender': 'Employee_Gender',
   
})

# Renaming columns for gdp_df
gdp_df = gdp_df.rename(columns={
    'Value': 'GDP_Value',
    'Value Binned': 'GDP_Value_Binned',
    
})

# Renaming columns for graduates_df
graduates_df = graduates_df.rename(columns={
    'Value': 'Number_of_Graduates',
    'Gender': 'Graduates_Gender',

})

In [1099]:
employment_df

,Date,Labour Force Characteristics,NAICS,Employee_Gender,Age Group,Number_of_Employees
0,2000,Employed,Accommodation and food services [72],Female,15 to 24 years,235000
1,2000,Employed,Accommodation and food services [72],Female,25 to 54 years,285400
2,2000,Employed,Accommodation and food services [72],Female,55 years and over,37700
3,2000,Employed,Accommodation and food services [72],Male,15 to 24 years,160900
4,2000,Employed,Accommodation and food services [72],Male,25 to 54 years,193500
...,...,...,...,...,...,...
4279,2020,Unemployed,Utilities [22],Female,25 to 54 years,0
4280,2020,Unemployed,Utilities [22],Female,55 years and over,0
4281,2020,Unemployed,Utilities [22],Male,15 to 24 years,0
4282,2020,Unemployed,Utilities [22],Male,25 to 54 years,1743
4283,2020,Unemployed,Utilities [22],Male,55 years and over,0

In [1100]:
gdp_df

,Date,NAICS,GDP_Value,GDP_Value_Binned
0,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]"
1,2000,"Agriculture, forestry, fishing and hunting [11]",23120000000,"(21000000000.0, 49000000000.0]"
2,2000,Construction [23],51054000000,"(49000000000.0, 76000000000.0]"
3,2000,Educational services [61],51839000000,"(49000000000.0, 76000000000.0]"
4,2000,Finance and insurance [52],62648000000,"(49000000000.0, 76000000000.0]"
...,...,...,...,...
352,2020,Public administration [91],158772000000,"(158000000000.0, 185000000000.0]"
353,2020,Real estate and rental and leasing [53],293886000000,"(267000000000.0, 294000000000.0]"
354,2020,Retail trade [44-45],106641000000,"(103000000000.0, 131000000000.0]"
355,2020,Transportation and warehousing [48-49],95339000000,"(76000000000.0, 103000000000.0]"
356,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]"

In [1101]:
graduates_df

,Date,Field Of Study,Graduates_Gender,Number_of_Graduates,Value Binned
0,2000,"Agriculture, natural resources and conservatio...",Man,7818.0,"(0.0, 16247.1]"
1,2000,"Agriculture, natural resources and conservatio...",Woman,6390.0,"(0.0, 16247.1]"
2,2000,"Architecture, engineering and related technolo...",Man,52596.0,"(48717.3, 64952.4]"
3,2000,"Architecture, engineering and related technolo...",Woman,12987.0,"(0.0, 16247.1]"
4,2000,"Business, management and public administration...",Man,49608.0,"(48717.3, 64952.4]"
...,...,...,...,...,...
583,2020,Social and behavioural sciences and law [4],Woman,118131.0,"(113657.7, 129892.8]"
584,2020,Unclassified,Man,5154.0,"(0.0, 16247.1]"
585,2020,Unclassified,Woman,3426.0,"(0.0, 16247.1]"
586,2020,"Visual and performing arts, and communications...",Man,16872.0,"(16247.1, 32482.2]"
587,2020,"Visual and performing arts, and communications...",Woman,26505.0,"(16247.1, 32482.2]"

## Join gdp and employment on NAICS and year

In [1102]:
merged_df = pd.merge(
    gdp_df,
    employment_df,
    how='inner', 
    left_on=['NAICS', 'Date'], 
    right_on=['NAICS', 'Date']  
)

In [1103]:
merged_df

,Date,NAICS,GDP_Value,GDP_Value_Binned,Labour Force Characteristics,Employee_Gender,Age Group,Number_of_Employees
0,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,15 to 24 years,235000
1,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,25 to 54 years,285400
2,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,55 years and over,37700
3,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Male,15 to 24 years,160900
4,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Male,25 to 54 years,193500
...,...,...,...,...,...,...,...,...
4279,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Female,25 to 54 years,0
4280,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Female,55 years and over,0
4281,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,15 to 24 years,0
4282,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,25 to 54 years,1743
4283,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,55 years and over,0

## Now we join the third df with our merged df on year

In [1104]:
final_merged_df = pd.merge(
    merged_df,
    graduates_df,
    on='Date',  
    how='inner' 
)

In [1105]:
final_merged_df

,Date,NAICS,GDP_Value,GDP_Value_Binned,Labour Force Characteristics,Employee_Gender,Age Group,Number_of_Employees,Field Of Study,Graduates_Gender,Number_of_Graduates,Value Binned
0,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,15 to 24 years,235000,"Agriculture, natural resources and conservatio...",Man,7818.0,"(0.0, 16247.1]"
1,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,15 to 24 years,235000,"Agriculture, natural resources and conservatio...",Woman,6390.0,"(0.0, 16247.1]"
2,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,15 to 24 years,235000,"Architecture, engineering and related technolo...",Man,52596.0,"(48717.3, 64952.4]"
3,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,15 to 24 years,235000,"Architecture, engineering and related technolo...",Woman,12987.0,"(0.0, 16247.1]"
4,2000,Accommodation and food services [72],22863000000,"(21000000000.0, 49000000000.0]",Employed,Female,15 to 24 years,235000,"Business, management and public administration...",Man,49608.0,"(48717.3, 64952.4]"
...,...,...,...,...,...,...,...,...,...,...,...,...
119947,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,55 years and over,0,Social and behavioural sciences and law [4],Woman,118131.0,"(113657.7, 129892.8]"
119948,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,55 years and over,0,Unclassified,Man,5154.0,"(0.0, 16247.1]"
119949,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,55 years and over,0,Unclassified,Woman,3426.0,"(0.0, 16247.1]"
119950,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,55 years and over,0,"Visual and performing arts, and communications...",Man,16872.0,"(16247.1, 32482.2]"
119951,2020,Utilities [22],50976000000,"(49000000000.0, 76000000000.0]",Unemployed,Male,55 years and over,0,"Visual and performing arts, and communications...",Woman,26505.0,"(16247.1, 32482.2]"

## Now, we replace our dimension values with their corresponding PFKs and drop unnecessary columns

In [1106]:
final_merged_df.rename(columns={'Date': 'year'}, inplace=True)
final_merged_df.rename(columns={'Field Of Study': 'field_of_study'}, inplace=True)
final_merged_df.rename(columns={'NAICS': 'sector_name'}, inplace=True)
final_merged_df.rename(columns={'Labour Force Characteristics': 'employment_status'}, inplace=True)


final_merged_df = final_merged_df.merge(df_date_dim[['date_key', 'year']], on='year', how='left')
final_merged_df.drop(columns=['year'], inplace=True)

final_merged_df = final_merged_df.merge(df_education_dim[['education_key', 'field_of_study']], on='field_of_study', how='left')
final_merged_df.drop(columns=['field_of_study'], inplace=True)

final_merged_df = final_merged_df.merge(df_industry_dim[['industry_key', 'sector_name']], on='sector_name', how='left')
final_merged_df.drop(columns=['sector_name'], inplace=True)

final_merged_df = final_merged_df.merge(df_status_dim[['employment_key', 'employment_status']], on='employment_status', how='left')
final_merged_df.drop(columns=['employment_status'], inplace=True)

final_merged_df = final_merged_df.merge(
    df_demographic_dim[['demographic_key', 'gender', 'age_group']],
    left_on=['Employee_Gender', 'Age Group'],
    right_on=['gender', 'age_group'],
    how='left'
)

final_merged_df.drop(columns=['Employee_Gender', 'Age Group', 'gender'], inplace=True)


columns_to_keep = ['date_key', 'education_key', 'industry_key', 'demographic_key','employment_key' ,'Number_of_Employees', 'GDP_Value', 'Number_of_Graduates', 'Graduates_Gender']
final_merged_df = final_merged_df[columns_to_keep]

final_merged_df.rename(columns={'employment_key': 'employment_status_key'}, inplace=True)
final_merged_df.rename(columns={'Number_of_Employees': 'number_of_employees'}, inplace=True)
final_merged_df.rename(columns={'GDP_Value': 'gdp_value'}, inplace=True)
final_merged_df.rename(columns={'Number_of_Graduates': 'number_of_graduates'}, inplace=True)
final_merged_df.rename(columns={'Graduates_Gender': 'graduates_gender'}, inplace=True)

In [1107]:
final_merged_df

,date_key,education_key,industry_key,demographic_key,employment_status_key,number_of_employees,gdp_value,number_of_graduates,graduates_gender
0,1,1,1,1,1,235000,22863000000,7818.0,Man
1,1,1,1,1,1,235000,22863000000,6390.0,Woman
2,1,2,1,1,1,235000,22863000000,52596.0,Man
3,1,2,1,1,1,235000,22863000000,12987.0,Woman
4,1,3,1,1,1,235000,22863000000,49608.0,Man
...,...,...,...,...,...,...,...,...,...
119947,21,12,17,6,2,0,50976000000,118131.0,Woman
119948,21,13,17,6,2,0,50976000000,5154.0,Man
119949,21,13,17,6,2,0,50976000000,3426.0,Woman
119950,21,14,17,6,2,0,50976000000,16872.0,Man
119951,21,14,17,6,2,0,50976000000,26505.0,Woman

## Now, we populate our fact table

In [1108]:
# Assuming final_merged_df is your DataFrame prepared for insertion
final_merged_df.to_sql(
    name='fact_table',  # The name of the target table
    con=engine,         # The SQLAlchemy connection engine
    if_exists='replace', # Append data to the table if it already exists
    index=False,        # Do not write the DataFrame index as a column
    dtype={             # Specify SQL data types for finer control over the table schema
        'date_key': sqlalchemy.types.INTEGER,
        'education_key': sqlalchemy.types.INTEGER,
        'industry_key': sqlalchemy.types.INTEGER,
        'demographic_key': sqlalchemy.types.INTEGER,
        'employment_status_key': sqlalchemy.types.INTEGER,  # Add this line if you're including employment_status_key
        'number_of_employees': sqlalchemy.types.Numeric,
        'gdp_value': sqlalchemy.types.Numeric,
        'number_of_graduates': sqlalchemy.types.Numeric,
        'graduates_gender': sqlalchemy.types.VARCHAR(255)
    }
)

952

In [1109]:
engine.dispose()